{
    "name": "Akshar Patel",
    "contact": {
        "email": "aksharcommit@gmail.com",
        "github": "https://github.com/AksharP5",
        "linkedin": "linkedin.com/in/akshar5",
        "portfolio": "aksharp5.github.io/portfolio"
    },
    "experience": [
        {
            "role": "Data Analyst",
            "company": "Dow Jones",
            "period": "July 2025 - Present",
            "location": "Princeton, NJ",
            "bullets": [
                "Developed a Python script to de-duplicate save tracking data, reducing daily manual effort by over 60% and increasing reporting accuracy",
                "Generated interactive dashboards and KPI reports to monitor QA metrics, improving visibility and accelerating stakeholder decision-making",
                "Leveraged AWS cloud infrastructure and SQL-based queries to process high-volume data efficiently, reducing analysis time and improving reporting scalability",
                "Delivered actionable data stories to senior stakeholders, leveraging advanced analytics to highlight trends, improve SLAs, and drive process optimization"
            ]
        },
        {
            "role": "Desktop Support Assistant",
            "company": "Western New England University",
            "period": "March 2023 - May 2025",
            "location": "Springfield, MA",
            "bullets": [
                "Provided technical support to students, faculty, and staff across Windows and macOS, resolving issues via phone, email, and remote sessions",
                "Troubleshot walk-in issues including network connectivity, printing failures, and account access problems",
                "Re-imaged systems and configured software to restore functionality and meet IT compliance standards",
                "Maintained and prepared lab and classroom workstations to ensure reliable daily operation for students and faculty"
            ]
        }
    ],
    "projects": [
        {
            "name": "Find Fake Friends",
            "tech": "JavaScript, HTML/CSS, Git",
            "link": "https://aksharp5.github.io/FindFakeFriends/",
            "bullets": [
                "Built a privacy-first web app that analyzes Instagram data entirely in the browser.",
                "Designed a responsive UI with drag-and-drop ZIP file upload for seamless user experience.",
                "Automated categorization of followers into mutuals, non-followers, and one-sided followers."
            ]
        },
        {
            "name": "Bear Necessities Market",
            "tech": "JavaScript, Vue.js, Docker, RabbitMQ, MongoDB",
            "link": "https://gitlab.com/LibreFoodPantry/client-solutions/bear-necessities-market",
            "bullets": [
                "Developed a microservice-based reporting system to separate reporting logic from core services, improving modularity and maintainability.",
                "Built RESTful APIs and data pipelines to aggregate and structure visit and inventory data for reporting.",
                "Integrated RabbitMQ for asynchronous, real-time data synchronization across microservices."
            ]
        },
        {
            "name": "ourPLCC",
            "tech": "Python, Java, Docker, Git",
            "link": "https://github.com/ourPLCC",
            "bullets": [
                "Developed a modular command-line interface with subcommands, such as scan, enabling streamlined interaction with core features.",
                "Implemented LL(1) grammar validation using FIRST and FOLLOW set algorithms, enabling automated conflict detection.",
                "Built a custom implementation of Paull’s algorithm with bookkeeping and error tracing to eliminate left recursion in grammars",
                "Automated testing and validation across 32 predefined languages using using Docker, GitHub Actions, and bats for CI/CD workflows"
            ]
        }
    ],
    "education": {
        "school": "Western New England University",
        "years": "Aug 2021 - May 2025",
        "degree": "Bachelor of Science in Computer Science",
        "location": "Springfield, MA"
    },
     
}